# MassDataSillHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassDataSillHeight Property
ParameterTypeId Class See Also
---
"Target Sill Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassDataSillHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassDataSillHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassDataSillHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace